{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.2.6", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_3", "layers": [{"class_name": "Conv2D", "config": {"name": "conv2d_2", "trainable": true, "batch_input_shape": [null, 192, 192, 3], "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_5", "trainable": true, "dtype": "float32", "units": 5, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": "categorical_crossentropy", "metrics": ["accuracy"], "weighted_metrics": null, "sample_weight_mode": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of71.bin", "group1-shard2of71.bin", "group1-shard3of71.bin", "group1-shard4of71.bin", "group1-shard5of71.bin", "group1-shard6of71.bin", "group1-shard7of71.bin", "group1-shard8of71.bin", "group1-shard9of71.bin", "group1-shard10of71.bin", "group1-shard11of71.bin", "group1-shard12of71.bin", "group1-shard13of71.bin", "group1-shard14of71.bin", "group1-shard15of71.bin", "group1-shard16of71.bin", "group1-shard17of71.bin", "group1-shard18of71.bin", "group1-shard19of71.bin", "group1-shard20of71.bin", "group1-shard21of71.bin", "group1-shard22of71.bin", "group1-shard23of71.bin", "group1-shard24of71.bin", "group1-shard25of71.bin", "group1-shard26of71.bin", "group1-shard27of71.bin", "group1-shard28of71.bin", "group1-shard29of71.bin", "group1-shard30of71.bin", "group1-shard31of71.bin", "group1-shard32of71.bin", "group1-shard33of71.bin", "group1-shard34of71.bin", "group1-shard35of71.bin", "group1-shard36of71.bin", "group1-shard37of71.bin", "group1-shard38of71.bin", "group1-shard39of71.bin", "group1-shard40of71.bin", "group1-shard41of71.bin", "group1-shard42of71.bin", "group1-shard43of71.bin", "group1-shard44of71.bin", "group1-shard45of71.bin", "group1-shard46of71.bin", "group1-shard47of71.bin", "group1-shard48of71.bin", "group1-shard49of71.bin", "group1-shard50of71.bin", "group1-shard51of71.bin", "group1-shard52of71.bin", "group1-shard53of71.bin", "group1-shard54of71.bin", "group1-shard55of71.bin", "group1-shard56of71.bin", "group1-shard57of71.bin", "group1-shard58of71.bin", "group1-shard59of71.bin", "group1-shard60of71.bin", "group1-shard61of71.bin", "group1-shard62of71.bin", "group1-shard63of71.bin", "group1-shard64of71.bin", "group1-shard65of71.bin", "group1-shard66of71.bin", "group1-shard67of71.bin", "group1-shard68of71.bin", "group1-shard69of71.bin", "group1-shard70of71.bin", "group1-shard71of71.bin"], "weights": [{"name": "conv2d_2/kernel", "shape": [3, 3, 3, 64], "dtype": "float32"}, {"name": "conv2d_2/bias", "shape": [64], "dtype": "float32"}, {"name": "dense_4/kernel", "shape": [577600, 128], "dtype": "float32"}, {"name": "dense_4/bias", "shape": [128], "dtype": "float32"}, {"name": "dense_5/kernel", "shape": [128, 5], "dtype": "float32"}, {"name": "dense_5/bias", "shape": [5], "dtype": "float32"}]}]}